<?php

$cardNumber = random_int(6, 14);
$cardSet = [
  6 => "Шістку",
  7 =>  "Сімку",
  8 =>  "Вісімку",
  9 =>  "Дев'ятку",
  10 =>  "Десятку",
  11 =>  "Валет",
  12 =>  "Даму",
  13 =>  "Короля",
  14 =>  "Туз"
];

echo "Людина в мантії: \"Назвіть про себе номер від 6 до 14.\"", PHP_EOL;
echo "Ви: (\"Компрендо, хай буде {$cardNumber}.\")", PHP_EOL;
echo "Людина в мантії: \"Номер {$cardNumber}. Значить {$cardSet[$cardNumber]}.\" Людина в мантії показала гральну картку.", PHP_EOL;
echo "Ви: (\"Воу, да він маг!\")", PHP_EOL;
echo "Маг: \"ТАК Я МАГ! А тепер, переказуй гроші на рахунок UA843000010000000047330992708.\"", PHP_EOL;
echo "Ви: (\"Допомога ЗСУ?)\"", PHP_EOL;
echo "Маг: \"Переказуй або відчуешь на собі темну магію!\"", PHP_EOL;
